---
kind: method
id: M:Autodesk.Revit.DB.ExportLinetypeInfo.Dispose
source: html/1ca76e40-eb94-6909-6b7d-ef05b9f958bd.htm
---
# Autodesk.Revit.DB.ExportLinetypeInfo.Dispose Method

Releases all resources used by the ExportLinetypeInfo

## Syntax (C#)
```csharp
public void Dispose()
```